In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("TC4C_stock_data.csv")
df.head()

              Date        Open       Close         Low        High    Volume
0  August 17, 2017  USD 122.56  USD 116.95  USD 115.74  USD 125.53  116425.0
1  August 18, 2017  USD 116.95  USD 118.95  USD 115.07   USD 120.1  113528.0
2  August 19, 2017         NaN         NaN         NaN         NaN       NaN
3  August 20, 2017         NaN         NaN         NaN         NaN       NaN
4  August 21, 2017  USD 118.95  USD 120.46  USD 116.34  USD 123.48  137030.0

In [3]:
df.shape

(2252, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2252 entries, 0 to 2251
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    2252 non-null   object
 1   Open    1608 non-null   object
 2   Close   1608 non-null   object
 3   Low     1608 non-null   object
 4   High    1608 non-null   object
 5   Volume  1608 non-null   float64
dtypes: float64(1), object(5)
memory usage: 105.7+ KB

In [9]:
df['Date'] = pd.to_datetime(df['Date'])
# except ValueError:
error_rows = df[pd.to_datetime(df['Date'], errors='coerce').isna()]
print("Error converting dates in the following rows:")
print(error_rows)

Error converting dates in the following rows:
Empty DataFrame
Columns: [Date, Open, Close, Low, High, Volume]
Index: []

In [5]:
# missing data
missing_perc = df.isna().sum()/len(df)
# print(type(missing_perc))
missing = df.isna().sum()
missing_data = pd.DataFrame({'Missing' : missing, 'Percentage' : missing_perc})
missing_data

        Missing  Percentage
Date          0    0.000000
Open        644    0.285968
Close       644    0.285968
Low         644    0.285968
High        644    0.285968
Volume      644    0.285968

In [6]:
# 1. Remove rows with missing values from the dataframe and print the number of rows remaining.
df = df.dropna()
print(f"Number of rows remaining: {len(df)}")

# 2. For the `Open`, `Close`, `Low`, and `High` columns, remove the "USD" prefix and convert them to numeric types.
for col in ["Open", "Close", "Low", "High"]:
  df[col] = pd.to_numeric(df[col].str.replace("USD ", ""))

# Print the first 5 rows of the dataframe after the conversion.
df.head()

Number of rows remaining: 1608

              Date    Open   Close     Low    High    Volume
0  August 17, 2017  122.56  116.95  115.74  125.53  116425.0
1  August 18, 2017  116.95  118.95  115.07  120.10  113528.0
4  August 21, 2017  118.95  120.46  116.34  123.48  137030.0
5  August 22, 2017  120.46  123.19  119.46  123.99  113922.0
6  August 23, 2017  123.19  124.47  121.38  128.98   70739.0

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1608 entries, 0 to 2251
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    1608 non-null   object
 1   Open    1608 non-null   float64
 2   Close   1608 non-null   float64
 3   Low     1608 non-null   float64
 4   High    1608 non-null   float64
 5   Volume  1608 non-null   float64
dtypes: float64(5), object(1)
memory usage: 87.9+ KB